{
  "status": 200,
  "data": {
    "id": "123-123-123-123",
    "title": "Top 10 Best Movies of 2023",
    "author": "Cnext",
    "description": "a top ten list of 2023",
    "license": "by-sa",
    "metadata": {},
    "items": [
      {
        "id": "10",
        "indent": 0,
        "order": 0,
        "parent": null,
        "title": "#10 Are you there God? It's me, Margaret",
        "description": "Are You There God? It's Me, Margaret. is a middle-grade novel by American writer Judy Blume, published in 1970. Its protagonist, Margaret Simon, is a sixth-grader who grows up without a religious affiliation because of her parents' interfaith marriage. This contemporary realistic novel was popular with middle-grade readers in the 1970s for its relatable portrayal of a young girl confronting early-adolescent anxieties, such as menstruation, brassieres and boys.",
        "metadata": {
          "source": "https://www.youtube.com/watch?v=6mexBBaLkZ0",
          "timecode": 45,
          "author":"Cnext",
          "thumbnail": "https://www.starzcsr.com/wp-content/uploads/2023/09/key_are-you-there-god-its-me-margaret.jpeg"
        }
      },
      {
        "id": "9",
        "indent": 0,
        "order": 0,
        "parent": null,
        "title": "#9 Teenage Mutant Ninja Turtles: Mutant Mayhem",
        "description": "Teenage Mutant Ninja Turtles: Mutant Mayhem is a 2023 American animated superhero film based on the Teenage Mutant Ninja Turtles characters created by Peter Laird and Kevin Eastman. A reboot of the Turtles film series, it was directed by Jeff Rowe, who co-wrote the screenplay with Seth Rogen, Evan Goldberg, Dan Hernandez, and Benji Samit and developed the story with Rogen, Goldberg, and Brendan O'Brien. The film stars an ensemble voice cast with Micah Abbey, Shamon Brown Jr., Nicolas Cantu, and Brady Noon as the four Turtles—Donatello, Michelangelo, Leonardo, and Raphael—and follows the group as they go on a hunt for a mysterious crime syndicate and face an army of mutants.",
        "metadata": {
          "source": "https://www.youtube.com/watch?v=6mexBBaLkZ0",
          "timecode": 94,
          "author":"Cnext",
          "thumbnail": "https://myhotposters.com/cdn/shop/products/mL6844_1024x1024.jpg?v=1693608185"
        }
      },
      {
        "id": "8",
        "indent": 0,
        "order": 0,
        "parent": null,
        "title": "#8 Dungeons & Dragons: Honor Among Thieves",
        "description": "Dungeons & Dragons: Honor Among Thieves is a 2023 American fantasy heist action comedy film directed by Jonathan Goldstein and John Francis Daley, who co-wrote the screenplay with Michael Gilio from a story by Chris McKay and Gilio. Based on the tabletop role-playing game Dungeons & Dragons, it is set in the Forgotten Realms campaign setting and has no connections to the previous film trilogy released between 2000 and 2012.",
        "metadata": {
          "source": "https://www.youtube.com/watch?v=6mexBBaLkZ0",
          "timecode": 135,
          "author":"Cnext",
          "thumbnail": "https://www.paramountmovies.com/uploads/movies/dungeons-dragons-honor-among-thieves/dnd-pmshare-1200x630-c.jpg"
        }
      }, 
      {
        "id": "7",
        "indent": 0,
        "order": 0,
        "parent": null,
        "title": "#7 Barbie",
        "description": "Barbie is a 2023 fantasy comedy film directed by Greta Gerwig from a screenplay she wrote with Noah Baumbach. Based on the eponymous fashion dolls by Mattel, it is the first live-action Barbie film after numerous computer-animated films and specials. The film stars Margot Robbie as the title character and Ryan Gosling as Ken, and follows the pair on a journey of self-discovery following an existential crisis.",
        "metadata": {
          "source": "https://www.youtube.com/watch?v=6mexBBaLkZ0",
          "timecode": 191,
          "author":"Cnext",
          "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSX-urmaJfV8AV47LRgC2TF5g3ElBWMfsV7Ve9zF8oF333HuuDJM1E16ii8fiRYaSN985I&usqp=CAU"
        }
      },
      {
        "id": "6",
        "indent": 0,
        "order": 0,
        "parent": null,
        "title": "#6 John Wick: Chapter 4",
        "description": "John Wick: Chapter 4 (also known as John Wick 4 or JW4 and known in Japan as John Wick: Consequences) is a 2023 American neo-noir action thriller film directed and co-produced by Chad Stahelski and written by Shay Hatten and Michael Finch. The sequel to John Wick: Chapter 3 – Parabellum (2019) and the fourth installment in the John Wick franchise, the film stars Keanu Reeves as the title character, alongside Donnie Yen, Bill Skarsgård, Laurence Fishburne, Hiroyuki Sanada, Shamier Anderson, Lance Reddick, Rina Sawayama, Scott Adkins, Clancy Brown, and Ian McShane. In the film, John Wick sets out to get revenge on the High Table and those who left him for dead.",
        "metadata": {
          "source": "https://www.youtube.com/watch?v=6mexBBaLkZ0",
          "timecode": 257,
          "author":"Cnext",
          "thumbnail": "https://dx35vtwkllhj9.cloudfront.net/studiocanalintl/john-wick-chapter-4/images/regions/au/header.jpg"
        }
      },
      {
        "id": "5",
        "indent": 0,
        "order": 0,
        "parent": null,
        "title": "#5 Guardians of the Galaxy Vol. 3",
        "description": "Guardians of the Galaxy Vol. 3 is a 2023 American superhero film based on the Marvel Comics superhero team Guardians of the Galaxy, produced by Marvel Studios, and distributed by Walt Disney Studios Motion Pictures. It is the sequel to Guardians of the Galaxy (2014) and Guardians of the Galaxy Vol. 2 (2017), and the 32nd film in the Marvel Cinematic Universe (MCU). Written and directed by James Gunn, it features an ensemble cast including Chris Pratt, Zoe Saldaña, Dave Bautista, Karen Gillan, Pom Klementieff, Vin Diesel, Bradley Cooper, Will Poulter, Sean Gunn, Chukwudi Iwuji, Linda Cardellini, Nathan Fillion, and Sylvester Stallone.",
        "metadata": {
          "source": "https://www.youtube.com/watch?v=6mexBBaLkZ0",
          "timecode": 316,
          "author":"Cnext",
          "thumbnail": "https://mickeyblog.com/wp-content/uploads/2023/02/2023-marvel-guardians-of-the-galaxy-vol-3-logo-1-1-720x329.jpg"
        }
      },
      {
        "id": "4",
        "indent": 0,
        "order": 0,
        "parent": null,
        "title": "#4 Killers of the Flower Moon",
        "description": "Killers of the Flower Moon is a 2023 American epic Western crime drama film directed and co-produced by Martin Scorsese, who also co-wrote the script alongside Eric Roth, based on the 2017 non-fiction book by David Grann Killers of the Flower Moon: The Osage Murders and the Birth of the FBI. Set in 1920s Oklahoma, it focuses on a series of murders of Osage members and relations in the Osage Nation after oil was discovered on tribal land. The tribal members had retained mineral rights on their reservation, and white opportunists sought to take the tribal members' wealth.",
        "metadata": {
          "source": "https://www.youtube.com/watch?v=6mexBBaLkZ0",
          "timecode": 371,
          "author":"Cnext",
          "thumbnail": "https://i.ytimg.com/vi/7cx9nCHsemc/maxresdefault.jpg"
        }
      },
      {
        "id": "3",
        "indent": 0,
        "order": 0,
        "parent": null,
        "title": "#3 Spider-Man: Across the Spider-Verse",
        "description": "Spider-Man: Across the Spider-Verse is a 2023 American animated superhero film featuring the Marvel Comics character Miles Morales / Spider-Man, produced by Columbia Pictures and Sony Pictures Animation in association with Marvel Entertainment, and distributed by Sony Pictures Releasing. It is the sequel to Spider-Man: Into the Spider-Verse (2018), set in a shared multiverse of alternate universes called the Spider-Verse. The film is directed by Joaquim Dos Santos, Kemp Powers and Justin K. Thompson from a screenplay by Phil Lord, Christopher Miller who both also produce, and David Callaham",
        "metadata": {
          "source": "https://www.youtube.com/watch?v=6mexBBaLkZ0",
          "timecode": 431,
          "author":"Cnext",
          "thumbnail": "https://images.thedirect.com/media/article_full/across-the-spider-verse-box-office.jpg"
        }
      },
      {
        "id": "2",
        "indent": 0,
        "order": 0,
        "parent": null,
        "title": "#2 Mission: Impossible - Dead Reckoning Part One",
        "description": "Mission: Impossible – Dead Reckoning Part One is a 2023 American spy action film directed by Christopher McQuarrie, from a screenplay he co-wrote with Erik Jendresen. It is the sequel to Mission: Impossible – Fallout (2018) and the seventh installment in the Mission: Impossible film series. It stars Tom Cruise as Ethan Hunt, alongside an ensemble cast including Hayley Atwell, Ving Rhames, Simon Pegg, Rebecca Ferguson, Vanessa Kirby, Esai Morales, Pom Klementieff, Mariela Garriga, and Henry Czerny. In the film, Hunt and his IMF team face off against 'the Entity', a powerful rogue AI.",
        "metadata": {
          "source": "https://www.youtube.com/watch?v=6mexBBaLkZ0",
          "timecode": 495,
          "author":"Cnext",
          "thumbnail": "https://images.squarespace-cdn.com/content/v1/63bb3e8a824d7e2f7eedf0d3/8a225826-3c04-42d0-a654-eb1552f23d7f/Mission+Impossible+7+Horizontal.jpeg"
        }
      },
      {
        "id": "1",
        "indent": 0,
        "order": 0,
        "parent": null,
        "title": "#1 Oppenheimer",
        "description": "Oppenheimer is a 2023 epic biographical thriller film written and directed by Christopher Nolan. It stars Cillian Murphy as J. Robert Oppenheimer, the American theoretical physicist credited with being the 'father of the atomic bomb' for his role in the Manhattan Project—the World War II undertaking that developed the first nuclear weapons.",
        "metadata": {
          "source": "https://www.youtube.com/watch?v=6mexBBaLkZ0",
          "timecode": 628,
          "author":"Cnext",
          "thumbnail": "https://media.cinemacloud.co.uk/imageFilm/1519_1_2.jpg"
        }
      }
    ]
  }
}